
## Plan Result (dev)

[CI link](https://github.com/marufeuille/ClearBag/actions/runs/22391031496)


<pre><code>Plan: 17 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_project_iam_member.github_actions[&#34;roles/cloudtasks.admin&#34;]
  * google_project_iam_member.github_actions[&#34;roles/datastore.owner&#34;]
  * module.api_service.google_cloud_run_v2_service.this
  * module.api_service.google_cloud_run_v2_service_iam_member.public[0]
  * module.cloud_storage_uploads.google_storage_bucket.this
  * module.cloud_storage_uploads.google_storage_bucket_iam_member.object_admin
  * module.cloud_tasks_analysis.google_cloud_tasks_queue.this
  * module.cloud_tasks_analysis.google_project_iam_member.tasks_enqueuer
  * module.firestore.google_firestore_database.this
  * module.firestore.google_firestore_index.events_by_start
  * module.firestore.google_firestore_index.tasks_by_completed
  * module.firestore.google_project_iam_member.firestore_user
  * module.morning_digest_scheduler.google_cloud_scheduler_job.this
  * module.secret_sendgrid_api_key.google_secret_manager_secret.this
  * module.secret_sendgrid_api_key.google_secret_manager_secret_iam_member.accessor
  * module.secret_vapid_private_key.google_secret_manager_secret.this
  * module.secret_vapid_private_key.google_secret_manager_secret_iam_member.accessor
* Update
  * module.cloud_run_job.google_cloud_run_v2_job.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_iam_member.github_actions["roles/cloudtasks.admin"] will be created
  + resource "google_project_iam_member" "github_actions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-deploy@marufeuille-linebot.iam.gserviceaccount.com"
      + project = "marufeuille-linebot"
      + role    = "roles/cloudtasks.admin"
    }

  # google_project_iam_member.github_actions["roles/datastore.owner"] will be created
  + resource "google_project_iam_member" "github_actions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-deploy@marufeuille-linebot.iam.gserviceaccount.com"
      + project = "marufeuille-linebot"
      + role    = "roles/datastore.owner"
    }

  # module.api_service.google_cloud_run_v2_service.this will be created
  + resource "google_cloud_run_v2_service" "this" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "clearbag-api-dev"
      + observed_generation     = (known after apply)
      + project                 = "marufeuille-linebot"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = 80
          + service_account                  = "school-agent-v2-dev@marufeuille-linebot.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "asia-northeast1-docker.pkg.dev/clearbag-dev/school-agent-dev/clearbag-api:latest"

              + env {
                  + name = "ALLOWED_EMAILS"
                }
              + env {
                  + name  = "CLOUD_TASKS_LOCATION"
                  + value = "asia-northeast1"
                }
              + env {
                  + name  = "CLOUD_TASKS_QUEUE"
                  + value = "clearbag-analysis-dev"
                }
              + env {
                  + name = "FIREBASE_PROJECT_ID"
                }
              + env {
                  + name  = "GCS_BUCKET_NAME"
                  + value = "marufeuille-linebot-clearbag-uploads-dev"
                }
              + env {
                  + name  = "GEMINI_MODEL"
                  + value = "gemini-2.5-pro"
                }
              + env {
                  + name  = "PROJECT_ID"
                  + value = "marufeuille-linebot"
                }
              + env {
                  + name = "SENDGRID_API_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "clearbag-sendgrid-api-key-dev"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "SERVICE_ACCOUNT_EMAIL"
                  + value = "school-agent-v2-dev@marufeuille-linebot.iam.gserviceaccount.com"
                }
              + env {
                  + name = "VAPID_PRIVATE_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "clearbag-vapid-private-key-dev"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "VERTEX_AI_LOCATION"
                  + value = "asia-northeast1"
                }
              + env {
                  + name  = "WORKER_URL"
                  + value = "https://clearbag-api-dev-45853049159.asia-northeast1.run.app/worker/analyze"
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "1Gi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }
        }
    }

  # module.api_service.google_cloud_run_v2_service_iam_member.public[0] will be created
  + resource "google_cloud_run_v2_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + name     = "clearbag-api-dev"
      + project  = "marufeuille-linebot"
      + role     = "roles/run.invoker"
    }

  # module.cloud_run_job.google_cloud_run_v2_job.this will be updated in-place
  ~ resource "google_cloud_run_v2_job" "this" {
        id                       = "projects/marufeuille-linebot/locations/asia-northeast1/jobs/school-agent-v2-dev"
        name                     = "school-agent-v2-dev"
        # (22 unchanged attributes hidden)

      ~ template {
            # (4 unchanged attributes hidden)

          ~ template {
                # (5 unchanged attributes hidden)

              ~ containers {
                  ~ command    = [
                      + "python",
                      + "-m",
                      + "v2.entrypoints.cli",
                    ]
                    # (3 unchanged attributes hidden)

                    # (8 unchanged blocks hidden)
                }
            }
        }
    }

  # module.cloud_storage_uploads.google_storage_bucket.this will be created
  + resource "google_storage_bucket" "this" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "marufeuille-linebot-clearbag-uploads-dev"
      + project                     = "marufeuille-linebot"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 180
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = false
        }
    }

  # module.cloud_storage_uploads.google_storage_bucket_iam_member.object_admin will be created
  + resource "google_storage_bucket_iam_member" "object_admin" {
      + bucket = "marufeuille-linebot-clearbag-uploads-dev"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:school-agent-v2-dev@marufeuille-linebot.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.cloud_tasks_analysis.google_cloud_tasks_queue.this will be created
  + resource "google_cloud_tasks_queue" "this" {
      + id       = (known after apply)
      + location = "asia-northeast1"
      + name     = "clearbag-analysis-dev"
      + project  = "marufeuille-linebot"

      + rate_limits {
          + max_burst_size            = (known after apply)
          + max_concurrent_dispatches = 3
          + max_dispatches_per_second = 1
        }

      + retry_config {
          + max_attempts       = 5
          + max_backoff        = "300s"
          + max_doublings      = 4
          + max_retry_duration = (known after apply)
          + min_backoff        = "10s"
        }
    }

  # module.cloud_tasks_analysis.google_project_iam_member.tasks_enqueuer will be created
  + resource "google_project_iam_member" "tasks_enqueuer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:school-agent-v2-dev@marufeuille-linebot.iam.gserviceaccount.com"
      + project = "marufeuille-linebot"
      + role    = "roles/cloudtasks.enqueuer"
    }

  # module.firestore.google_firestore_database.this will be created
  + resource "google_firestore_database" "this" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + database_edition                  = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "DELETE"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "asia-northeast1"
      + name                              = "(default)"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "marufeuille-linebot"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # module.firestore.google_firestore_index.events_by_start will be created
  + resource "google_firestore_index" "events_by_start" {
      + api_scope   = "ANY_API"
      + collection  = "events"
      + database    = "(default)"
      + density     = (known after apply)
      + id          = (known after apply)
      + multikey    = false
      + name        = (known after apply)
      + project     = "marufeuille-linebot"
      + query_scope = "COLLECTION"

      + fields {
          + field_path = "user_uid"
          + order      = "ASCENDING"
        }
      + fields {
          + field_path = "start"
          + order      = "ASCENDING"
        }
    }

  # module.firestore.google_firestore_index.tasks_by_completed will be created
  + resource "google_firestore_index" "tasks_by_completed" {
      + api_scope   = "ANY_API"
      + collection  = "tasks"
      + database    = "(default)"
      + density     = (known after apply)
      + id          = (known after apply)
      + multikey    = false
      + name        = (known after apply)
      + project     = "marufeuille-linebot"
      + query_scope = "COLLECTION"

      + fields {
          + field_path = "user_uid"
          + order      = "ASCENDING"
        }
      + fields {
          + field_path = "completed"
          + order      = "ASCENDING"
        }
    }

  # module.firestore.google_project_iam_member.firestore_user will be created
  + resource "google_project_iam_member" "firestore_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:school-agent-v2-dev@marufeuille-linebot.iam.gserviceaccount.com"
      + project = "marufeuille-linebot"
      + role    = "roles/datastore.user"
    }

  # module.morning_digest_scheduler.google_cloud_scheduler_job.this will be created
  + resource "google_cloud_scheduler_job" "this" {
      + id        = (known after apply)
      + name      = "clearbag-morning-digest-dev"
      + paused    = (known after apply)
      + project   = "marufeuille-linebot"
      + region    = "asia-northeast1"
      + schedule  = "30 7 * * *"
      + state     = (known after apply)
      + time_zone = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = (known after apply)

          + oauth_token {
              + scope                 = "https://www.googleapis.com/auth/cloud-platform"
              + service_account_email = "school-agent-v2-dev@marufeuille-linebot.iam.gserviceaccount.com"
            }
        }
    }

  # module.secret_sendgrid_api_key.google_secret_manager_secret.this will be created
  + resource "google_secret_manager_secret" "this" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "marufeuille-linebot"
      + secret_id             = "clearbag-sendgrid-api-key-dev"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_sendgrid_api_key.google_secret_manager_secret_iam_member.accessor will be created
  + resource "google_secret_manager_secret_iam_member" "accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:school-agent-v2-dev@marufeuille-linebot.iam.gserviceaccount.com"
      + project   = "marufeuille-linebot"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "clearbag-sendgrid-api-key-dev"
    }

  # module.secret_vapid_private_key.google_secret_manager_secret.this will be created
  + resource "google_secret_manager_secret" "this" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "marufeuille-linebot"
      + secret_id             = "clearbag-vapid-private-key-dev"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_vapid_private_key.google_secret_manager_secret_iam_member.accessor will be created
  + resource "google_secret_manager_secret_iam_member" "accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:school-agent-v2-dev@marufeuille-linebot.iam.gserviceaccount.com"
      + project   = "marufeuille-linebot"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "clearbag-vapid-private-key-dev"
    }

Plan: 17 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + api_service_url                      = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":37,"Program":"tfcmt","SHA1":"0a159eaebf45cc1ac2930dd520ba6abd1f2b7517","Target":"dev","Vars":{},"WorkflowName":"terraform plan dev"} -->